/******************* (C) COPYRIGHT 2009~2019 holychip **************************
* File Name          : WDT.c
* Author             : Touch Team
* Version            : V1.0.5.0
* Date               : 2019/10/01
********************************************************************************


*******************************************************************************/
#include "HC89F303B.h"
#include "WDT\WDT.h"
#include "HC89F30xB_SYS.h"
#include "Fun_Handle\Fun_Handle.h"
#include "HC_Delay.h"

//===============================================================================
//WDT 时钟测量与WDTCCR配置
//本程序不允许修改
void WDT_Clock_Freq_Cal(void)
{
	WDTCCR = (u32)WDT_WAKE_TIMER * 44000 / 1000 / 256+1;
}

//===============================================================================
//WDTC配置,使用WDT溢出唤醒时，EA&EWDT必需为"1"，且延时大于100US后，MCU才允许操作PCON寄存器，控制MCU工作模式
//本程序不允许修改
#pragma disable
void WDT_INIT(void)
{
	WDTC = 0x15; // 1:256  //不允许修改
	EWDT = 1;
	Delay_100us(1); //must > 100us
}

//===============================================================================
//WDT中段处理程序
//本程序不允许修改
void WDT_ISR_Handle(void)
{
	WDTC = 0x05; // 1:256
}
/*********************************END OF FILE************************************/
